Output from `terraform plan`
```
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-reference-production-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-reference-production-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "reference"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-batch-reference-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "reference"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-reference-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-production"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-production,dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-reference-production"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-sentence-production-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-sentence-production-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "sentence"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-batch-sentence-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "sentence"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-sentence-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-production"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-production,dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-sentence-production"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-visits-production-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-visits-production-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::004723187462:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-production"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-production"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "visits"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-batch-visits-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "visits"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-production"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-visits-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-production"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-production"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-production,dpr-curated-zone-production"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-visits-production"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "oracle"
      + extra_connection_attributes = "supportResetlog=TRUE"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 1521
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + map_boolean_as_boolean = true
        }
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-production"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-operator-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["nomis"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-s3-endpoint-role"
    }

Plan: 583 to add, 0 to change, 0 to destroy.

```